---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.Append(Autodesk.Revit.DB.ReferenceArray)
source: html/13ce18da-00dc-c833-2718-1af0f496f0fe.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	ReferenceArray item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ReferenceArray`)